
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>研究生的人生方向选择 · ideas</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Chaogang Chen">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-katex/katex.min.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../算法/readme.html" />
    
    
    <link rel="prev" href="氢能源的未来.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://chaogangchen.github.io" target="_blank" class="custom-link">Chaogang's Blog</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="../思辨/readme.html">
            
                <a href="../思辨/readme.html">
            
                    
                    思辨
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.1.1" data-path="../思辨/公权力与私权利之间的哲学关系.html">
            
                <a href="../思辨/公权力与私权利之间的哲学关系.html">
            
                    
                    公权力和私权利之间的哲学关系
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="readme.html">
            
                <a href="readme.html">
            
                    
                    择业
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="3.1.1" data-path="计算机行业的魅力.html">
            
                <a href="计算机行业的魅力.html">
            
                    
                    计算机行业的魅力
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.1.2" data-path="汽车行业的魅力.html">
            
                <a href="汽车行业的魅力.html">
            
                    
                    汽车行业的魅力
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.1.3" data-path="氢能源的未来.html">
            
                <a href="氢能源的未来.html">
            
                    
                    氢能源的未来
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="3.1.4" data-path="研究生的人生方向选择.html">
            
                <a href="研究生的人生方向选择.html">
            
                    
                    研究生的人生方向选择
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="../算法/readme.html">
            
                <a href="../算法/readme.html">
            
                    
                    算法
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="4.1.1" data-path="../算法/贪心算法.html">
            
                <a href="../算法/贪心算法.html">
            
                    
                    贪心算法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.1.2" data-path="../算法/排序算法.html">
            
                <a href="../算法/排序算法.html">
            
                    
                    排序算法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.1.3" data-path="../算法/动态规划.html">
            
                <a href="../算法/动态规划.html">
            
                    
                    动态规划
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="5.1" data-path="../笔记/readme.html">
            
                <a href="../笔记/readme.html">
            
                    
                    笔记
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="5.1.1" data-path="../笔记/西交LBM.html">
            
                <a href="../笔记/西交LBM.html">
            
                    
                    西交LBM
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="6.1" data-path="../技术/readme.html">
            
                <a href="../技术/readme.html">
            
                    
                    技术
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="6.1.1" data-path="../技术/在ubuntu上使用latex.html">
            
                <a href="../技术/在ubuntu上使用latex.html">
            
                    
                    在Ubuntu上使用LaTex
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >研究生的人生方向选择</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7814;&#x7A76;&#x751F;&#x7684;&#x4EBA;&#x751F;&#x65B9;&#x5411;&#x9009;&#x62E9;">&#x7814;&#x7A76;&#x751F;&#x7684;&#x4EBA;&#x751F;&#x65B9;&#x5411;&#x9009;&#x62E9;</h1>
<p>&#x4EBA;&#x751F;&#x65B9;&#x5411;&#x592A;&#x591A;&#x4E86;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x600E;&#x4E48;&#x9009;&#x624D;&#x5BF9;&#x3002;</p>
<h2 id="&#x53BB;&#x8F66;&#x4F01;">&#x53BB;&#x8F66;&#x4F01;</h2>
<p>&#x8F66;&#x4F01;&#x6162;&#x6162;&#x4E0D;&#x518D;&#x662F;&#x8F66;&#x8F86;&#x5DE5;&#x7A0B;&#x6BD5;&#x4E1A;&#x540C;&#x5B66;&#x4EEC;&#x7684;&#x7B2C;&#x4E00;&#x9009;&#x62E9;&#x4E86;&#xFF0C;&#x5373;&#x4F7F;&#x540C;&#x5B66;&#x4EEC;&#x5728;&#x8F66;&#x4F01;&#x4E2D;&#x505A;&#x5230;&#x4E86;&#x4E0D;&#x4F4E;&#x7684;&#x804C;&#x4F4D;&#xFF0C;&#x6536;&#x5165;&#x4ECD;&#x7136;&#x96BE;&#x4EE5;&#x548C;&#x4E92;&#x8054;&#x7F51;&#x91D1;&#x878D;&#x6BD4;&#x80A9;&#x3002;&#x5728;&#x9AD8;&#x623F;&#x4EF7;&#x7684;&#x538B;&#x529B;&#x4E0B;&#xFF0C;&#x751F;&#x5B58;&#x91CD;&#x62C5;&#x538B;&#x5728;&#x5F88;&#x591A;&#x4EBA;&#x7684;&#x8EAB;&#x4E0A;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x7684;&#x52A8;&#x4F5C;&#x6216;&#x591A;&#x6216;&#x5C11;&#x6709;&#x6240;&#x53D8;&#x5F62;&#x3002;&#x6240;&#x4EE5;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x9700;&#x8981;&#x5BA1;&#x89C6;&#x81EA;&#x5DF1;&#x7684;&#x5185;&#x5FC3;&#xFF0C;&#x770B;&#x770B;&#x81EA;&#x5DF1;&#x7684;&#x521D;&#x5FC3;&#x662F;&#x4EC0;&#x4E48;&#x3002;</p>
<p>&#x8F66;&#x4F01;&#x80FD;&#x63D0;&#x4F9B;&#x7ED9;&#x8F66;&#x8F86;&#x5DE5;&#x7A0B;&#x6BD5;&#x4E1A;&#x751F;&#x7684;&#xFF0C;&#x5C31;&#x662F;&#x5341;&#x5E74;&#x5185;&#x7A33;&#x5B9A;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x4E0A;&#x6D77;&#x90CA;&#x533A;&#x76F8;&#x5BF9;&#x6E05;&#x95F2;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x4EE5;&#x53CA;&#x4E0D;&#x662F;&#x975E;&#x5E38;&#x5BCC;&#x8DB3;&#x7684;&#x79EF;&#x84C4;&#x3002;&#x65F6;&#x4EE3;&#x7684;&#x8F66;&#x8F6E;&#x78BE;&#x8FC7;&#xFF0C;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x804C;&#x4E1A;&#x662F;&#x7EDD;&#x5BF9;&#x5B89;&#x7A33;&#x7684;&#xFF0C;&#x5373;&#x4F7F;&#x8EAB;&#x5728;&#x8F66;&#x4F01;&#xFF0C;&#x4E5F;&#x96BE;&#x4EE5;&#x4FDD;&#x8BC1;&#x610F;&#x5916;&#x4E0D;&#x4F1A;&#x964D;&#x4E34;&#x3002;&#x5728;&#x8F66;&#x4F01;&#xFF0C;&#x540C;&#x6837;&#x4E5F;&#x4F1A;&#x9762;&#x5BF9;&#x4E1A;&#x52A1;&#x517C;&#x5E76;&#x91CD;&#x7EC4;&#xFF0C;&#x4F01;&#x4E1A;&#x53D1;&#x5C55;&#x65B9;&#x5411;&#x8C03;&#x6574;&#x7B49;&#x8BF8;&#x591A;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x4E00;&#x6B21;&#x6027;&#x505A;&#x597D;&#x4EBA;&#x751F;&#x7684;&#x51B3;&#x65AD;&#x5E76;&#x4E0D;&#x662F;&#x660E;&#x667A;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x5728;&#x6BCF;&#x8D70;&#x4E00;&#x6B65;&#x7684;&#x65F6;&#x5019;&#x9700;&#x8981;&#x5C3D;&#x91CF;&#x4FDD;&#x6301;&#x8DB3;&#x591F;&#x7684;&#x53D1;&#x5C55;&#x7A7A;&#x95F4;&#xFF0C;&#x8DEF;&#x8981;&#x8D8A;&#x8D70;&#x8D8A;&#x5BBD;&#xFF0C;&#x7EC8;&#x70B9;&#x5728;&#x54EA;&#x91CC;&#x8981;&#x6162;&#x6162;&#x60F3;&#x3002;</p>
<p>&#x867D;&#x7136;&#x4E94;&#x5E74;&#x5341;&#x5E74;&#x4E4B;&#x540E;&#x6C7D;&#x8F66;&#x884C;&#x4E1A;&#x5C06;&#x4F1A;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x72B6;&#x6001;&#x8FD8;&#x672A;&#x53EF;&#x77E5;&#xFF0C;&#x4F46;&#x662F;&#x6709;&#x4E00;&#x70B9;&#x5341;&#x5206;&#x786E;&#x5B9A;&#xFF0C;&#x5C31;&#x662F;&#x77E5;&#x8BC6;&#x548C;&#x6280;&#x672F;&#x6C38;&#x8FDC;&#x4F1A;&#x5728;&#x672A;&#x6765;&#x626E;&#x6F14;&#x4E3B;&#x8981;&#x7684;&#x89D2;&#x8272;&#xFF0C;&#x7EC8;&#x8EAB;&#x5B66;&#x4E60;&#x5C06;&#x4F1A;&#x662F;&#x6211;&#x4EEC;&#x8FD9;&#x4E00;&#x4EE3;&#x4EBA;&#x7684;&#x7EC8;&#x8EAB;&#x4EFB;&#x52A1;&#x3002;</p>
<p>&#x56DE;&#x5230;&#x9009;&#x62E9;&#x8F66;&#x4F01;&#x7684;&#x8FD9;&#x4E2A;&#x4E3B;&#x9898;&#xFF0C;&#x5BF9;&#x4E8E;&#x73B0;&#x5728;&#x7684;&#x5F88;&#x591A;&#x5E74;&#x8F7B;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x53BB;&#x8F66;&#x4F01;&#x5DE5;&#x4F5C;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x4E00;&#x79CD;&#x4F4E;&#x6210;&#x672C;&#x7684;&#x9003;&#x907F;&#x8EAB;&#x5FC3;&#x6467;&#x6B8B;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5E74;&#x8F7B;&#x4EBA;&#x901A;&#x8FC7;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x6362;&#x53D6;&#x66F4;&#x52A0;&#x6E05;&#x51C0;&#x7684;&#x8EAB;&#x5FC3;&#x3002;&#x5F53;&#x5E74;&#x6C7D;&#x8F66;&#x4F01;&#x4E1A;&#x75AF;&#x72C2;&#x53D1;&#x85AA;&#x6C34;&#x7684;&#x8F89;&#x714C;&#x666F;&#x8C61;&#x5DF2;&#x7136;&#x4E0D;&#x5728;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x5BF9;&#x8F66;&#x4F01;&#x90FD;&#x6709;&#x8DB3;&#x591F;&#x7B2C;&#x7684;&#x9884;&#x671F;&#x3002;&#x8FD9;&#x79CD;&#x6536;&#x5165;&#x4F4E;&#x9884;&#x671F;&#x4E0E;&#x6781;&#x9AD8;&#x7684;&#x7ECF;&#x6D4E;&#x538B;&#x529B;&#x7ED3;&#x5408;&#xFF0C;&#x6210;&#x4E3A;&#x4E86;&#x5E74;&#x8F7B;&#x4EBA;&#x5728;&#x793E;&#x4F1A;&#x4E0A;&#x7684;&#x7B2C;&#x4E00;&#x6B21;&quot;&#x6BD2;&#x6253;&quot;&#x3002;</p>
<h2 id="&#x53BB;&#x5927;&#x5382;">&#x53BB;&#x5927;&#x5382;</h2>
<p>&#x5927;&#x5382;&#x7684;&#x5DE5;&#x4F5C;&#x6700;&#x4E3B;&#x8981;&#x7684;&#x7279;&#x5F81;&#x5C31;&#x662F;&#x9AD8;&#x85AA;&#x6C34;&#x3001;&#x9AD8;&#x538B;&#x529B;&#x3001;&#x9AD8;&#x65F6;&#x957F;&#x3002;</p>
<p>&#x5982;&#x679C;&#x6211;&#x9009;&#x62E9;&#x53BB;&#x5927;&#x5382;&#x5DE5;&#x4F5C;&#xFF0C;&#x975E;&#x79D1;&#x73ED;&#x751F;&#x7684;&#x8EAB;&#x4EFD;&#x5C06;&#x4F1A;&#x662F;&#x6211;&#x7684;&#x4E3B;&#x8981;&#x969C;&#x788D;&#xFF0C;&#x4E0A;&#x6D77;&#x5E02;&#x533A;&#x7684;&#x4E00;&#x5957;&#x623F;&#x53EF;&#x80FD;&#x4F1A;&#x6210;&#x4E3A;&#x6211;&#x4E8C;&#x5341;&#x5E74;&#x5185;&#x7684;&#x4E3B;&#x8981;&#x76EE;&#x6807;&#x3002;&#x5728;&#x8FD9;&#x6761;&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x5F00;&#x59CB;&#x5377;&#x7684;&#x8DEF;&#x4E0A;&#xFF0C;&#x6240;&#x6709;&#x77E5;&#x8BC6;&#x90FD;&#x9700;&#x8981;&#x91CD;&#x65B0;&#x5B66;&#x4E60;&#xFF0C;&#x968F;&#x65F6;&#x8981;&#x9762;&#x4E34;&#x88AB;&#x4F01;&#x4E1A;&#x6DD8;&#x6C70;&#x7684;&#x98CE;&#x9669;&#xFF0C;&#x800C;&#x4E14;&#x8D85;&#x957F;&#x7684;&#x5DE5;&#x4F5C;&#x65F6;&#x957F;&#x5C06;&#x4F1A;&#x6324;&#x538B;&#x6211;&#x7684;&#x751F;&#x6D3B;&#x3002;&#x611F;&#x89C9;&#x5C31;&#x50CF;&#x662F;&#xFF0C;&#x5728;&#x5E94;&#x8BE5;&#x6210;&#x5BB6;&#x7ACB;&#x4E1A;&#x7684;&#x5E74;&#x7EAA;&#xFF0C;&#x91CD;&#x65B0;&#x4F53;&#x9A8C;&#x4E00;&#x6B21;&#x5343;&#x519B;&#x4E07;&#x9A6C;&#x8FC7;&#x72EC;&#x6728;&#x6865;&#x3002;</p>
<h2 id="&#x8003;&#x516C;&#x52A1;&#x5458;">&#x8003;&#x516C;&#x52A1;&#x5458;</h2>
<p>&#x548C;&#x5728;&#x4F01;&#x4E1A;&#x5DE5;&#x4F5C;&#x4E0D;&#x540C;&#xFF0C;&#x8003;&#x516C;&#x52A1;&#x5458;&#x662F;&#x4E00;&#x79CD;&#x4E0D;&#x7528;&#x7ED9;&#x8D44;&#x672C;&#x5BB6;&#x6253;&#x5DE5;&#x7684;&#x9009;&#x62E9;&#x3002;</p>
<p>&#x516C;&#x52A1;&#x5458;&#x7684;&#x672C;&#x5206;&#x5C31;&#x662F;&#x4E3A;&#x4EBA;&#x6C11;&#x670D;&#x52A1;&#xFF0C;&#x5982;&#x679C;&#x8DB3;&#x591F;&#x5E78;&#x8FD0;&#x53C8;&#x8DB3;&#x591F;&#x52AA;&#x529B;&#xFF0C;&#x8BF4;&#x4E0D;&#x5B9A;&#x80FD;&#x5728;&#x5408;&#x9002;&#x7684;&#x5E74;&#x7EAA;&#x9047;&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x4F2F;&#x4E50;&#xFF0C;&#x6210;&#x4E3A;&#x6307;&#x70B9;&#x6C5F;&#x5C71;&#x7684;&#x667A;&#x5E93;&#x91CC;&#x7684;&#x661F;&#x661F;&#x4E00;&#x70B9;&#x3002;&#x4F46;&#x662F;&#x5927;&#x90E8;&#x5206;&#x516C;&#x52A1;&#x5458;&#x505A;&#x5230; &#x5385;&#x957F;&#x5DF2;&#x7ECF;&#x975E;&#x5E38;&#x56F0;&#x96BE;&#xFF0C;&#x60F3;&#x8981;&#x7EE7;&#x7EED;&#x4E0A;&#x5347;&#x66F4;&#x662F;&#x96BE;&#x4E0A;&#x52A0;&#x96BE;&#xFF0C;&#x8BB8;&#x8BB8;&#x591A;&#x591A;&#x7684;&#x4EBA;&#x60C5;&#x7EC3;&#x8FBE;&#xFF0C;&#x4E16;&#x95F4;&#x767E;&#x6001;&#xFF0C;&#x5728;&#x516C;&#x52A1;&#x5458;&#x7684;&#x4F53;&#x7CFB;&#x4E2D;&#x5C06;&#x4F1A;&#x4F53;&#x73B0;&#x5F97;&#x66F4;&#x52A0;&#x660E;&#x663E;&#x3002;</p>
<p>&#x516C;&#x52A1;&#x5458;&#x8003;&#x8BD5;&#x672C;&#x8EAB;&#x5DF2;&#x7ECF;&#x5F88;&#x96BE;&#xFF0C;&#x60F3;&#x8981;&#x6210;&#x4E3A;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x5458;&#x9700;&#x8981;&#x4ED8;&#x51FA;&#x4E0D;&#x5C11;&#x7684;&#x52AA;&#x529B;&#x3002;&#x6211;&#x4E0D;&#x662F;&#x5F88;&#x786E;&#x5B9A;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x4E00;&#x5929;&#x771F;&#x7684;&#x6709;&#x6210;&#x4E3A;&#x516C;&#x52A1;&#x5458;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x6211;&#x4E5F;&#x8BB8;&#x4F1A;&#x52A8;&#x5FC3;&#x3002;</p>
<h2 id="&#x8BFB;&#x535A;">&#x8BFB;&#x535A;</h2>
<p>&#x535A;&#x58EB;&#x7684;&#x4E0A;&#x9650;&#x6700;&#x9AD8;&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;&#x7528;&#x7A77;&#x56F0;&#x7684;&#x4E94;&#x5E74;&#xFF0C;&#x6362;&#x53D6;&#x5B89;&#x5B9A;&#x8212;&#x9002;&#x7684;&#x4E2D;&#x8001;&#x5E74;&#x3002;&#x4ECE;&#x67D0;&#x79CD;&#x610F;&#x4E49;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E5F;&#x8BB8;&#x662F;&#x5168;&#x5C40;&#x7684;&#x6700;&#x4F18;&#x89E3;&#x3002;</p>
<p>&#x5BF9;&#x7537;&#x751F;&#x6765;&#x8BF4;&#xFF0C;&#x9009;&#x62E9;&#x8BFB;&#x535A;&#x57FA;&#x672C;&#x5C31;&#x662F;&#x9009;&#x62E9;&#x4E8C;&#x7EBF;&#x57CE;&#x5E02;&#xFF0C;&#x7537;&#x6027;&#x571F;&#x535A;&#x7559;&#x5728;&#x4E0A;&#x6D77;&#x7684;&#x5C11;&#x4E4B;&#x53C8;&#x5C11;&#x3002;&#x8FD9;&#x4E00;&#x70B9;&#x5176;&#x5B9E;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x5FC3;&#x77E5;&#x809A;&#x660E;&#xFF0C;&#x4E0A;&#x6D77;&#x5E76;&#x4E0D;&#x662F;&#x975E;&#x5E38;&#x9002;&#x5408;&#x5B66;&#x672F;&#xFF0C;&#x5982;&#x679C;&#x60F3;&#x8981;&#x5B8C;&#x6210;&#x5B66;&#x672F;&#x7406;&#x60F3;&#xFF0C;&#x5C31;&#x6CA1;&#x529E;&#x6CD5;&#x5728;&#x4E00;&#x7EBF;&#x57CE;&#x5E02;&#x7ACB;&#x8DB3;&#x3002;</p>
<p>&#x5982;&#x679C;&#x8BFB;&#x535A;&#xFF0C;&#x80AF;&#x5B9A;&#x4F1A;&#x9762;&#x5BF9;&#x540C;&#x9F84;&#x4EBA;&#x7684;peer pressure&#xFF0C;&#x5468;&#x56F4;&#x7684;&#x672C;&#x79D1;&#x7855;&#x58EB;&#x540C;&#x5B66;&#x53EF;&#x80FD;&#x90FD;&#x5DF2;&#x7ECF;&#x5B8C;&#x6210;&#x4E86;&#x81EA;&#x5DF1;&#x8D44;&#x672C;&#x7684;&#x539F;&#x59CB;&#x79EF;&#x7D2F;&#xFF0C;&#x4E8B;&#x4E1A;&#x548C;&#x751F;&#x6D3B;&#x5C0F;&#x6709;&#x8D77;&#x8272;&#xFF0C;&#x6211;&#x8FD8;&#x662F;&#x4E00;&#x4E2A;&#x9AD8;&#x6821;&#x91CC;&#x6CA1;&#x6709;&#x6BD5;&#x4E1A;&#x524D;&#x9014;&#x672A;&#x535C;&#x7684;&#x535A;&#x58EB;&#x751F;&#x3002;</p>
<p>&#x535A;&#x58EB;&#x4E5F;&#x4E0D;&#x662F;&#x4E00;&#x6761;&#x8F7B;&#x677E;&#x7684;&#x8DEF;&#xFF0C;&#x5176;&#x5B9E;&#x6211;&#x5185;&#x5FC3;&#x662F;&#x9189;&#x5FC3;&#x4E8E;&#x5B66;&#x672F;&#x7684;&#xFF0C;&#x9AD8;&#x4E2D;&#x7684;&#x65F6;&#x5019;&#x66FE;&#x7ECF;&#x7ACB;&#x5FD7;&#x4EE5;&#x540E;&#x8981;&#x53BB;&#x5251;&#x6865;&#x7684;&#x5361;&#x6587;&#x8FEA;&#x8BB8;&#x5B9E;&#x9A8C;&#x5BA4;&#xFF0C;&#x4F46;&#x662F;&#x5927;&#x5B66;&#x7684;&#x65F6;&#x5019;&#x5E76;&#x6CA1;&#x6709;&#x4E3B;&#x52A8;&#x5728;&#x5E76;&#x4E0D;&#x5BCC;&#x9976;&#x7684;&#x5B66;&#x672F;&#x571F;&#x58E4;&#x4E2D;&#x4E3B;&#x52A8;&#x63A5;&#x53D7;&#x5149;&#x7167;&#xFF0C;&#x5B66;&#x672F;&#x7406;&#x60F3;&#x4E0D;&#x77E5;&#x9053;&#x8FD8;&#x6709;&#x591A;&#x5C11;&#x53EF;&#x80FD;&#x3002;</p>
<h2 id="&#x56DE;&#x8001;&#x5BB6;">&#x56DE;&#x8001;&#x5BB6;</h2>
<p>&#x5176;&#x5B9E;&#x897F;&#x5B89;&#x7684;&#x7814;&#x7A76;&#x6240;&#x4E5F;&#x4E0D;&#x8D56;&#xFF0C;&#x90A3;&#x4E48;&#x591A;&#x7684;&#x822A;&#x5929;&#x9662;&#x6240;&#xFF0C;&#x80FD;&#x7ED9;&#x51FA;&#x7684;&#x5F85;&#x9047;&#x4E5F;&#x975E;&#x5E38;&#x53EF;&#x89C2;&#x3002;&#x897F;&#x5B89;&#x662F;&#x4E00;&#x4E2A;&#x751F;&#x6D3B;&#x538B;&#x529B;&#x4E0D;&#x90A3;&#x4E48;&#x5927;&#x7684;&#x57CE;&#x5E02;&#xFF0C;&#x6211;&#x4E5F;&#x5F88;&#x719F;&#x6089;&#xFF0C;&#x79BB;&#x5BB6;&#x4EBA;&#x4E5F;&#x8FD1;&#x3002;</p>
<p>&#x56DE;&#x897F;&#x5B89;&#x5176;&#x5B9E;&#x4E5F;&#x610F;&#x5473;&#x7740;&#x8F6C;&#x884C;&#xFF0C;&#x897F;&#x5B89;&#x5E76;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x591A;&#x7684;&#x5DE5;&#x4F5C;&#x53EF;&#x4EE5;&#x8BA9;&#x6211;&#x6311;&#x9009;&#xFF0C;&#x6211;&#x5BF9;&#x897F;&#x5B89;&#x7684;&#x5DE5;&#x4F5C;&#x5B8C;&#x5168;&#x6CA1;&#x6709;&#x6982;&#x5FF5;&#x3002;</p>
<h2 id="&#x672A;&#x66FE;&#x8BBE;&#x60F3;&#x7684;&#x5176;&#x4ED6;&#x9053;&#x8DEF;">&#x672A;&#x66FE;&#x8BBE;&#x60F3;&#x7684;&#x5176;&#x4ED6;&#x9053;&#x8DEF;</h2>
<p>&#x4E5F;&#x8BB8;&#x91CD;&#x5E86;&#x3001;&#x6B66;&#x6C49;&#x3001;&#x5408;&#x80A5;&#x3001;&#x5929;&#x6D25;&#x3001;&#x5357;&#x4EAC;&#x3001;&#x676D;&#x5DDE;&#x3001;&#x5317;&#x4EAC;&#x4F1A;&#x6709;&#x5176;&#x4ED6;&#x673A;&#x4F1A;&#xFF0C;&#x672A;&#x6765;&#x96BE;&#x6599;&#x3002;</p>
<p>&#x52A0;&#x6CB9;&#x5427;&#xFF0C;&#x673A;&#x4F1A;&#x603B;&#x662F;&#x7559;&#x7ED9;&#x6709;&#x51C6;&#x5907;&#x7684;&#x4EBA;&#xFF01;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="氢能源的未来.html" class="navigation navigation-prev " aria-label="Previous page: 氢能源的未来">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../算法/readme.html" class="navigation navigation-next " aria-label="Next page: 算法">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"研究生的人生方向选择","level":"3.1.4","depth":2,"next":{"title":"算法","level":"4.1","depth":1,"path":"算法/readme.md","ref":"算法/readme.md","articles":[{"title":"贪心算法","level":"4.1.1","depth":2,"path":"算法/贪心算法.md","ref":"算法/贪心算法.md","articles":[]},{"title":"排序算法","level":"4.1.2","depth":2,"path":"算法/排序算法.md","ref":"算法/排序算法.md","articles":[]},{"title":"动态规划","level":"4.1.3","depth":2,"path":"算法/动态规划.md","ref":"算法/动态规划.md","articles":[]}]},"previous":{"title":"氢能源的未来","level":"3.1.3","depth":2,"path":"择业/氢能源的未来.md","ref":"择业/氢能源的未来.md","articles":[]},"dir":"ltr"},"config":{"plugins":["katex"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"katex":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"Chaogang Chen","pdf":{"pageBreaksBefore":"/","headerTemplate":null,"paperSize":"a4","margin":{"right":62,"left":62,"top":36,"bottom":36},"fontSize":12,"fontFamily":"Arial","footerTemplate":null,"chapterMark":"pagebreak","pageNumbers":false},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"ideas","links":{"sharing":{"all":null,"facebook":null,"google":null,"twitter":null,"weibo":null},"sidebar":{"Chaogang's Blog":"https://chaogangchen.github.io"}},"gitbook":"*","description":"My Notebook","extension":null},"file":{"path":"择业/研究生的人生方向选择.md","mtime":"2021-12-15T07:39:02.878Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-12-20T14:34:44.961Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

